# Pandas: Missing Data, Groupby and Operations

## Missing Dara

In [126]:
import numpy as np
import pandas as pd

In [127]:
df1= pd.DataFrame({'City':['Berlin','Paris','Helsinki','Milano'],'Temperature (C)':[20,20,15,25]},index=[10,20,30,40])
df1

        City  Temperature (C)
10    Berlin               20
20     Paris               20
30  Helsinki               15
40    Milano               25

In [128]:
df2= pd.DataFrame({'City':['Berlin','Paris','Helsinki','Madrid'],'Humidity (%)':[60,50,80,np.nan]},index=[10,20,30,40])
df2

        City  Humidity (%)
10    Berlin          60.0
20     Paris          50.0
30  Helsinki          80.0
40    Madrid           NaN

In [129]:
df3= pd.DataFrame({'City':['Berlin','Paris','Helsinki','Milano','Madrid'],'Wind (km/h)':[10,8,14,6,8]},index=[10,20,30,40,50])
df3

        City  Wind (km/h)
10    Berlin           10
20     Paris            8
30  Helsinki           14
40    Milano            6
50    Madrid            8

In [130]:
merged_df= pd.merge(pd.merge(df1,df2,how='outer'),df3)
merged_df

       City  Temperature (C)  Humidity (%)  Wind (km/h)
0    Berlin             20.0          60.0           10
1     Paris             20.0          50.0            8
2  Helsinki             15.0          80.0           14
3    Milano             25.0           NaN            6
4    Madrid              NaN           NaN            8

In [131]:
merged_df.dropna()

       City  Temperature (C)  Humidity (%)  Wind (km/h)
0    Berlin             20.0          60.0           10
1     Paris             20.0          50.0            8
2  Helsinki             15.0          80.0           14

In [132]:
merged_df.dropna(axis=1)

       City  Wind (km/h)
0    Berlin           10
1     Paris            8
2  Helsinki           14
3    Milano            6
4    Madrid            8

In [133]:
# Keep the rows with atleast 3 non NaN values
merged_df.dropna(thresh=3)

       City  Temperature (C)  Humidity (%)  Wind (km/h)
0    Berlin             20.0          60.0           10
1     Paris             20.0          50.0            8
2  Helsinki             15.0          80.0           14
3    Milano             25.0           NaN            6

In [134]:
merged_df.fillna('A----B')

       City Temperature (C) Humidity (%)  Wind (km/h)
0    Berlin              20           60           10
1     Paris              20           50            8
2  Helsinki              15           80           14
3    Milano              25       A----B            6
4    Madrid          A----B       A----B            8

In [135]:
merged_df['Humidity (%)'].mean()

63.333333333333336

In [136]:
merged_df.fillna({'Temperature (C)':merged_df['Temperature (C)'].mean(),'Humidity (%)':merged_df['Humidity (%)'].mean()})

       City  Temperature (C)  Humidity (%)  Wind (km/h)
0    Berlin             20.0     60.000000           10
1     Paris             20.0     50.000000            8
2  Helsinki             15.0     80.000000           14
3    Milano             25.0     63.333333            6
4    Madrid             20.0     63.333333            8

## groupby

In [137]:
data={'company':['Google','Google','Google','Google','Facebook','Facebook','MAN','MAN','MAN'],
     'name':['sam','thomas','elnaz','mamad','chris','faraz','baharak','frank','sia'],
     'salary':[60000,65000,59000,66000,80000,85000,43000,45000,48000],
     'off days':[30,26,28,30,30,30,40,35,35]}

In [138]:
my_df= pd.DataFrame(data)
my_df

    company     name  salary  off days
0    Google      sam   60000        30
1    Google   thomas   65000        26
2    Google    elnaz   59000        28
3    Google    mamad   66000        30
4  Facebook    chris   80000        30
5  Facebook    faraz   85000        30
6       MAN  baharak   43000        40
7       MAN    frank   45000        35
8       MAN      sia   48000        35

In [139]:
my_df.groupby('company')

In [140]:
my_df.groupby('company').std()

               salary  off days
company
Facebook  3535.533906  0.000000
Google    3511.884584  1.914854
MAN       2516.611478  2.886751

In [141]:
my_df.groupby('company').max()

            name  salary  off days
company
Facebook   faraz   85000        30
Google    thomas   66000        30
MAN          sia   48000        40

In [142]:
my_df.groupby('company').min()

             name  salary  off days
company
Facebook    chris   80000        30
Google      elnaz   59000        26
MAN       baharak   43000        35

In [143]:
comp_grouped=my_df.groupby('company')

In [144]:
comp_grouped.count()

          name  salary  off days
company
Facebook     2       2         2
Google       4       4         4
MAN          3       3         3

In [145]:
my_df.groupby('company').mean().round().astype(int)

          salary  off days
company
Facebook   82500        30
Google     62500        28
MAN        45333        37

In [146]:
comp_grouped.describe()

         salary                                                        \
          count          mean          std      min      25%      50%
company
Facebook    2.0  82500.000000  3535.533906  80000.0  81250.0  82500.0
Google      4.0  62500.000000  3511.884584  59000.0  59750.0  62500.0
MAN         3.0  45333.333333  2516.611478  43000.0  44000.0  45000.0

                           off days                                         \
              75%      max    count       mean       std   min   25%   50%
company
Facebook  83750.0  85000.0      2.0  30.000000  0.000000  30.0  30.0  30.0
Google    65250.0  66000.0      4.0  28.500000  1.914854  26.0  27.5  29.0
MAN       46500.0  48000.0      3.0  36.666667  2.886751  35.0  35.0  35.0


           75%   max
company
Facebook  30.0  30.0
Google    30.0  30.0
MAN       37.5  40.0

In [147]:
comp_grouped.describe().transpose().round().astype(int)

company         Facebook  Google    MAN
salary   count         2       4      3
         mean      82500   62500  45333
         std        3536    3512   2517
         min       80000   59000  43000
         25%       81250   59750  44000
         50%       82500   62500  45000
         75%       83750   65250  46500
         max       85000   66000  48000
off days count         2       4      3
         mean         30      28     37
         std           0       2      3
         min          30      26     35
         25%          30      28     35
         50%          30      29     35
         75%          30      30     38
         max          30      30     40

In [148]:
comp_grouped.describe().transpose()['Google']

salary    count        4.000000
          mean     62500.000000
          std       3511.884584
          min      59000.000000
          25%      59750.000000
          50%      62500.000000
          75%      65250.000000
          max      66000.000000
off days  count        4.000000
          mean        28.500000
          std          1.914854
          min         26.000000
          25%         27.500000
          50%         29.000000
          75%         30.000000
          max         30.000000
Name: Google, dtype: float64

## Operation

In [149]:
df4 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,np.nan,666,444],'col3':['wxyz','abcdef','baba','k']})
df4

   col1   col2    col3
0     1  444.0    wxyz
1     2    NaN  abcdef
2     3  666.0    baba
3     4  444.0       k

#### Fining unique values

In [150]:
df4['col2'].unique()

array([444.,  nan, 666.])

#### number of unique values

In [151]:
df4['col2'].nunique()

2

#### count each value

In [152]:
df4['col2'].value_counts()

444.0    2
666.0    1
Name: col2, dtype: int64

#### sort values

In [153]:
#note that indexing doesn't change
df4.sort_values('col2')

   col1   col2    col3
0     1  444.0    wxyz
3     4  444.0       k
2     3  666.0    baba
1     2    NaN  abcdef

In [154]:
df4.sort_values('col3')

   col1   col2    col3
1     2    NaN  abcdef
2     3  666.0    baba
3     4  444.0       k
0     1  444.0    wxyz

#### apply functions to values

In [155]:
def times2(x):
    return x*2

In [156]:
df4.apply(times2)

   col1    col2          col3
0     2   888.0      wxyzwxyz
1     4     NaN  abcdefabcdef
2     6  1332.0      babababa
3     8   888.0            kk

In [157]:
df4['col1'].apply(lambda x:x**2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

#### Find Null Values

In [158]:
df4.isnull()

    col1   col2   col3
0  False  False  False
1  False   True  False
2  False  False  False
3  False  False  False